# Rebar Bend Data Termination Orientation 1 Property

Source: https://www.revitapidocs.com/2026/8bc5901e-5c58-ef36-2ccc-50e001e6867e.htm

---

| Rebar Bend Data Termination Orientation 1 Property |
| --- |

Identifies the orientation of the termination (e.g. hook, crank) at the end.
 The default value is RebarTerminationOrientation::Left.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public RebarTerminationOrientation TerminationOrientation1 { get; set; }
```

```
Public Property TerminationOrientation1 As RebarTerminationOrientation
	Get
	Set
```

```
public:
property RebarTerminationOrientation TerminationOrientation1 {
	RebarTerminationOrientation get ();
	void set (RebarTerminationOrientation value);
}
```

```
member TerminationOrientation1 : RebarTerminationOrientation with get, set
```

#### Property Value

RebarTerminationOrientation Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace